//
//  main.m
//  指针偏移
//
//  Created by 张文艺 on 2021/10/12.
//

#import <Foundation/Foundation.h>
#import "NSperson.h"

/*
 &和*的理解
 */
/*
 &是取地址运算符
 *是间接寻址运算符
 */
void test11(){
    int a = 1;
    int *b = &a;
    int c = *b;
    
    NSLog(@"wenyi--a:%d,b:%p,c:%d",a,b,c);
}

/*
 基本数据类型
 
 结果：
 2021-10-12 12:29:14.880387+0800 指针偏移[70684:2791244] 基本数据类型的变量a:9 -- 变量地址：0x1040bb2bc
 2021-10-12 12:29:14.880773+0800 指针偏移[70684:2791244] 基本数据类型的变量b:10 -- 变量地址：0x1040bb2b8
 2021-10-12 12:29:14.880818+0800 指针偏移[70684:2791244] 基本数据类型的指针a:0x1040bb2bc -- 指针b：0x1040bb2b8
 2021-10-12 12:29:14.880848+0800 指针偏移[70684:2791244] 指针变量f所指向的a变量的内容：9 -- 变量b的内容：10
 2021-10-12 12:29:14.880872+0800 指针偏移[70684:2791244] 指针变量f所在的内存地址:0x1040bb2b0
 */

void baseDataTypeTest(){
    int a = 9;
    int b = 10;
    int *f = &a;
    
    NSLog(@"基本数据类型的变量a:%d -- 变量地址：%p",a,&a);
    NSLog(@"基本数据类型的变量b:%d -- 变量地址：%p",b,&b);
    NSLog(@"基本数据类型的指针a:%p -- 指针b：%p",f,f-1);
    NSLog(@"指针变量f所指向的a变量的内容：%d -- 变量b的内容：%d",*f,*(f-1));
    NSLog(@"指针变量f所在的内存地址:%p",&f);
}

/*
 引用类型
 指针是8个字节，所以相差8个字节
 
 结果：
 2021-10-12 12:29:14.881025+0800 指针偏移[70684:2791244] 引用类型的指针person1:<NSperson: 0x105014c50> -- 变量地址：0x1040bb2b8
 2021-10-12 12:29:14.881069+0800 指针偏移[70684:2791244] 引用类型的指针person2:<NSperson: 0x105013d90> -- 变量地址：0x1040bb2b0
 */

void quoteTest(){
    NSperson *person1 = [NSperson alloc];
    NSperson *person2 = [NSperson alloc];
    NSLog(@"引用类型的指针person1:%@ -- 变量地址：%p",person1,&person1);
    NSLog(@"引用类型的指针person2:%@ -- 变量地址：%p",person2,&person2);
}

/*
 数组
 
 
 结果：
 2021-10-12 12:29:14.881097+0800 指针偏移[70684:2791244] 数组所在地址：0x1040bb2a0 -- 数组首元素地址：0x1040bb2a0 -- 数组第二元素地址：0x1040bb2a4
 2021-10-12 12:29:14.881122+0800 指针偏移[70684:2791244] 数组所在地址：0x1040bb2a0 -- 数组第二元素地址：0x1040bb2a4 -- 数组第三元素地址：0x1040bb2a8
 2021-10-12 12:29:14.900159+0800 指针偏移[70684:2791244] 数组第一个元素：1 -- 数组第二元素地址：2 -- 数组第三元素地址：3

 说明：
 1、可以看到在数组中的元素在内存中是正序存储的,不是反序的
 */

void arrayTest(){
    int a = 10;
    int aa = 12;
    int c[4] = {1,2,3,4};
    int b = 20;
    int *d = c;
    NSLog(@"数组所在地址：%p -- 数组首元素地址：%p -- 数组第二元素地址：%p",&c,&c[0],&c[1]);
    NSLog(@"数组所在地址：%p -- 数组第二元素地址：%p -- 数组第三元素地址：%p",d,d+1,d+2);
    NSLog(@"数组第一个元素：%d -- 数组第二元素地址：%d -- 数组第三元素地址：%d",*d,*(d+1),*(d+2));
    NSLog(@"基本数据类型a:%p -- 基本数据类型b:%p -- aa:%p",&a,&b,&aa);
}

int main(int argc, const char * argv[]) {
    @autoreleasepool {
         insert code here...
        test11();
        baseDataTypeTest();
        quoteTest();
        arrayTest1();
        NSLog(@"Hello, World!");
    }
    return 0;
}
